#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Sat Feb  4 11:03:53 2023

add_design "C:/Users/93462/PdsProject/fpga-learn/rtl/flow_ledN.v"
remove_design -verilog "C:/Users/93462/PdsProject/fpga-learn/rtl/flow_ledN.v"
add_design "C:/Users/93462/PdsProject/fpga-learn/rtl/flow_ledN.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_ledN
add_constraint "C:/Users/93462/PdsProject/fpga-learn/project/flow_led.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_ledN
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_ledN
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_ledN
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_ledN
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "C:/Users/93462/PdsProject/fpga-learn/project/synthesize/flow_ledN_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_ledN
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
